app/controllers/subjects_controller.rb

SELECT "subjects".* FROM "subjects" ORDER BY subjects.position ASC
---
  def list
    @subjects = Subject.order("subjects.position ASC")

INSERT INTO "subjects" ("created_at", "name", "position", "updated_at", "visible") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 18 Apr 2013 08:42:36 UTC +00:00], ["name", "abc"], ["position", 1], ["updated_at", Thu, 18 Apr 2013 08:42:36 UTC +00:00], ["visible", false]]
---
  def create
    # Instantiate a new object using form parameters
    @subject = Subject.new(params[:subject])
    # Save the object
    if @subject.save

SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @subject = Subject.find(params[:id])

SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "subjects" SET "name" = '123', "position" = 1, "updated_at" = '2013-04-18 08:55:38.167058' WHERE "subjects"."id" = 3
---
  def update
     # Find object using form parameters
    @subject = Subject.find(params[:id])
    # Update the object
    if @subject.update_attributes(params[:subject])

SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", "1"]]
---
  def delete
    @subject = Subject.find(params[:id])

DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 1]]
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", "1"]]
---
  def destroy
    Subject.find(params[:id]).destroy